Revit 2026 API

# DividedPathCreate(Document, IListReference) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static DividedPath Create(
	Document document,
	IList<Reference> curveReferences
)
```
```vb
Public Shared Function Create (
	document As Document,
	curveReferences As IList(Of Reference)
) As DividedPath
```
```cpp
public:
static DividedPath^ Create(
	Document^ document,
	IList<Reference^>^ curveReferences
)
```
```fsharp
static member Create :
        document : Document *
        curveReferences : IList<Reference> -> DividedPath
```

#### Parameters

document Document

curveReferences IListReference

#### Return Value

DividedPath

#### Reference

DividedPath Class

Create Overload

Autodesk.Revit.DB Namespace